Autodesk.Revit.DB.Structure.RebarSpliceUtils.TransferTagsBetweenRebars(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Gets the tags from the source rebars and set for them a new host on destination rebars.
sourceRebarIds:
The ids of the source Rebar elements.
destinationRebarIds:
The ids of the destination Rebar elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.DisableShowButtonForErrors(Autodesk.Revit.DB.Transaction)
Disable the show button shwon for erros.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetRebarsToSplice(Autodesk.Revit.DB.Document)
Gets the rebars that are selected to be spliced.
Returns:
Returns the rebars that are selected to be spliced
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.SetDrawSpliceLinesAsCurrentEditor(Autodesk.Revit.DB.Document)
Sets the draw splice lines as current editor.
This is called from RebarSpliceUI addin when the command to draw splice lines is launched.
The handler for that button is looking at what editor is active to say if the button is checked or not.
aDoc:
The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceGeometriesThroughSpliceFace(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Face)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.UnifyRebarsIntoOne(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
This method will unify the rebars by removing the splice between them. A new rebar will be created because of this operation.
The curves of the resulted rebar will be the curves of the first rebar continued by the curves of the second rebar.
The resulted rebar will take data from the first rebar. (e.g.. layout, moved/removed bars, etc.).
document:
The document.
firstRebarId:
First Rebar id.
secondRebarId:
Second Rebar id.
Returns:
Returns the id of the new rebar. In case that unify operation fails, it will return invalidElementId
Throws Autodesk.Revit.Exceptions.ArgumentException:
Rebar elements must have a splice connection between them in order to be unified.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetLapDirectionForSpliceGeometryAndPosition(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Structure.RebarSpliceGeometry,Autodesk.Revit.DB.Structure.RebarSplicePosition)
This function calculates the lap direction given a RebarSpliceGeometry and a RebarSplicePosition.
Remarks:
This function determines first the point where the RebarSpliceGeometry will cut the rebar.
Based on the RebarSplicePosition value it will determine the direction where the lap will go, RebarSplicePosition.End1 meaning towards the start of the splice chain and RebarSplicePosition.End2 towards the end.
For more information about the splice chain concept please check Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Rebar rebar).
This function will throw exception if it's called with RebarSplicePosition.Middle.
rebar:
The input rebar.
spliceGeometry:
The splice geometry.
splicePosition:
The splice position.
Returns:
The lap direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
RebarSplicePosition should not be Middle.
-or-
The rebar cannot be spliced with the provided RebarSpliceGeometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceChain(Autodesk.Revit.DB.Structure.Rebar)
Returns all the rebars that are part of a splice chain with the input rebar.
Remarks:
The elements in the output list are in exactly the same order that they are constrained to each other.
The first element in the array is the one whose Rebar Plane, Out of Plane Extent and Edge are not constrained to a rebar from the chain (second is constrained to first, third to second and so on).
The output list will also contain the input rebar id.
If the rebar is not in a splice chain the returned list will contain just one element which is the id of the input rebar.
rebar:
The input rebar.
Returns:
The splice chain.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.CanRebarBeSpliced(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.XYZ)
Verifies if the rebar can be spliced with the provided line.
Remarks:
If the provided linePlaneNormal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be split.
Otherwise, the line will be extended to exceed the bounding box of the bar.
rebar:
The rebar to be spliced.
spliceOptions:
The RebarSpliceOptions.
line:
The line to splice the rebar with.
linePlaneNormal:
The normal that determines the plane of the line.
Returns:
Will return RebarSpliceError.Success if it's possible to splice with line or other enum value corresponding to the error that occurred.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.CanRebarBeSpliced(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ElementId)
Verifies if the rebar can be spliced with the provided line.
Remarks:
This method uses the view normal in case of a 2D view and the current workplane normal in case of a 3D view.
If the view normal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be split.
Otherwise, the line will be extended to exceed the bounding box of the bar.
rebar:
The rebar to be spliced.
spliceOptions:
The RebarSpliceOptions.
line:
The line to splice the rebar with.
viewId:
Based on the view it will be determined the plane of the line.
Returns:
Will return RebarSpliceError.Success if it's possible to splice with line or other enum value corresponding to the error that occurred.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.CanRebarBeSpliced(Autodesk.Revit.DB.Structure.Rebar,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Structure.RebarSpliceGeometry)
Verifies if the rebar can be spliced with the RebarSpliceGeometry.
rebar:
The rebar to be spliced.
spliceOptions:
The RebarSpliceOptions.
spliceGeometry:
The RebarSpliceGeometry.
Returns:
Will return RebarSpliceError.Success if it's possible to splice with point or other enum value corresponding to the error that occurred.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.XYZ)
Splice a rebar with a line.
Remarks:
If the provided linePlaneNormal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be split.
Otherwise, the line will be extended to exceed the bounding box of the bar.
document:
The document
rebarIdToSplit:
Rebar id to split.
spliceOptions:
The rebar splice options.
line:
The line used for splice.
linePlaneNormal:
The normal of the plane of the line.
Returns:
Returns the ids of the rebars that are considered to be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars, or Shape Driven Rebars that are Multiplanar or have a shape that whose definition is RebarShapeDefinitionByArc can't be spliced.
Also, if the Rebar is member of a Group it cannot be spliced.
-or-
The rebar cannot be spliced with the provided line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ElementId)
Splice a Rebar with a line.
Remarks:
This method uses the view normal in case of a 2D view and the current workplane normal in case of a 3D view.
If the view normal is parallel with the bar plane normal the bounded line will be used to calculate the splice geometries where the bar will be split.
Otherwise, the line will be extended to exceed the bounding box of the bar.
document:
The document
rebarIdToSplit:
Rebar id to split.
spliceOptions:
The rebar splice options.
line:
The line used for splice.
viewId:
Based on the view it will be determined the plane of the line.
Returns:
Returns the ids of the rebars that are considered to be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars, or Shape Driven Rebars that are Multiplanar or have a shape that whose definition is RebarShapeDefinitionByArc can't be spliced.
Also, if the Rebar is member of a Group it cannot be spliced.
-or-
The rebar cannot be spliced with the provided line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.GetSpliceGeometries(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,Autodesk.Revit.DB.Structure.RebarSpliceRules)
Computes a list of RebarSpliceGeometry which respects the rules. This list can be used to splice the Rebar.
document:
The document
rebarIdToSplit:
Rebar id to split.
spliceOptions:
The rebar splice options.
spliceRules:
The splice rules.
Returns:
Returns the result of the operation. If the operation was successful the RebarSpliceByRulesResult.Error member will have "RebarSpliceByRulesError.Success" value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
RebarSplicePosition should be Middle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils.SpliceRebar(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarSpliceOptions,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarSpliceGeometry})
Splice a rebar with a list of RebarSpliceGeometry.
document:
The document
rebarIdToSplit:
Rebar id to split.
spliceOptions:
The rebar splice options.
spliceGeometries:
A list of RebarSpliceGeometry that indicates where the rebar will be spliced.
Returns:
Returns the ids of the rebars that are considered to be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Free Form Rebars, or Shape Driven Rebars that are Multiplanar or have a shape that whose definition is RebarShapeDefinitionByArc can't be spliced.
Also, if the Rebar is member of a Group it cannot be spliced.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceUtils
Class with different utilities for Rebar Splice.
Since:
2025